data/OpenFOAM/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// omega=((0.09)**0.75)*((k)**1/2)/0.07=0.259

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 11511;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    exit
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    bottom
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    aerofoil
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //