data/OpenFOAM/system/internalCloudFoam_temp
/*--------------------------------*- C++ -*----------------------------------*\
 ========= |
 \\ / F ield | OpenFOAM: The Open Source CFD Toolbox
 \\ / O peration |
 \\ / A nd | Web: www.OpenFOAM.org
 \\/ M anipulation |
-------------------------------------------------------------------------------
Description
 Writes out values of fields interpolated to a specified cloud of s.

\*---------------------------------------------------------------------------*/

pts
(
points
);

// ************************************************************************* //