data/OpenFOAM/system/newCloud
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields interpolated to a specified cloud of points.

\*---------------------------------------------------------------------------*/

fields (p U);
points
(
(-0.5  -1.0  0.5)
(-0.5  -0.9921568627450981  0.5)
(-0.5  -0.9843137254901961  0.5)
(-0.5  -0.9764705882352941  0.5)
(-0.5  -0.9686274509803922  0.5)
(-0.5  -0.9607843137254902  0.5)
(-0.5  -0.9529411764705882  0.5)
(-0.5  -0.9450980392156862  0.5)
(-0.5  -0.9372549019607843  0.5)
(-0.5  -0.9294117647058824  0.5)
(-0.5  -0.9215686274509804  0.5)
(-0.5  -0.9137254901960784  0.5)
(-0.5  -0.9058823529411765  0.5)
(-0.5  -0.8980392156862745  0.5)
(-0.5  -0.8901960784313725  0.5)
(-0.5  -0.8823529411764706  0.5)
(-0.5  -0.8745098039215686  0.5)
(-0.5  -0.8666666666666667  0.5)
(-0.5  -0.8588235294117648  0.5)
(-0.5  -0.8509803921568627  0.5)
(-0.5  -0.8431372549019608  0.5)
(-0.5  -0.8352941176470589  0.5)
(-0.5  -0.8274509803921568  0.5)
(-0.5  -0.8196078431372549  0.5)
(-0.5  -0.8117647058823529  0.5)
(-0.5  -0.803921568627451  0.5)
(-0.5  -0.7960784313725491  0.5)
(-0.5  -0.788235294117647  0.5)
(-0.5  -0.7803921568627451  0.5)
(-0.5  -0.7725490196078432  0.5)
(-0.5  -0.7647058823529411  0.5)
(-0.5  -0.7568627450980392  0.5)
(-0.5  -0.7490196078431373  0.5)
(-0.5  -0.7411764705882353  0.5)
(-0.5  -0.7333333333333334  0.5)
(-0.5  -0.7254901960784313  0.5)
(-0.5  -0.7176470588235294  0.5)
(-0.5  -0.7098039215686275  0.5)
(-0.5  -0.7019607843137254  0.5)
(-0.5  -0.6941176470588235  0.5)
(-0.5  -0.6862745098039216  0.5)
(-0.5  -0.6784313725490196  0.5)
(-0.5  -0.6705882352941177  0.5)
(-0.5  -0.6627450980392157  0.5)
(-0.5  -0.6549019607843137  0.5)
(-0.5  -0.6470588235294118  0.5)
(-0.5  -0.6392156862745098  0.5)
(-0.5  -0.6313725490196078  0.5)
(-0.5  -0.6235294117647059  0.5)
(-0.5  -0.615686274509804  0.5)
(-0.5  -0.607843137254902  0.5)
(-0.5  -0.6  0.5)
(-0.5  -0.592156862745098  0.5)
(-0.5  -0.5843137254901961  0.5)
(-0.5  -0.5764705882352941  0.5)
(-0.5  -0.5686274509803921  0.5)
(-0.5  -0.5607843137254902  0.5)
(-0.5  -0.5529411764705883  0.5)
(-0.5  -0.5450980392156863  0.5)
(-0.5  -0.5372549019607843  0.5)
(-0.5  -0.5294117647058824  0.5)
(-0.5  -0.5215686274509804  0.5)
(-0.5  -0.5137254901960784  0.5)
(-0.5  -0.5058823529411764  0.5)
(-0.5  -0.4980392156862745  0.5)
(-0.5  -0.4901960784313726  0.5)
(-0.5  -0.48235294117647065  0.5)
(-0.5  -0.4745098039215686  0.5)
(-0.5  -0.4666666666666667  0.5)
(-0.5  -0.45882352941176474  0.5)
(-0.5  -0.4509803921568627  0.5)
(-0.5  -0.44313725490196076  0.5)
(-0.5  -0.43529411764705883  0.5)
(-0.5  -0.4274509803921569  0.5)
(-0.5  -0.41960784313725497  0.5)
(-0.5  -0.4117647058823529  0.5)
(-0.5  -0.403921568627451  0.5)
(-0.5  -0.39607843137254906  0.5)
(-0.5  -0.388235294117647  0.5)
(-0.5  -0.3803921568627451  0.5)
(-0.5  -0.37254901960784315  0.5)
(-0.5  -0.3647058823529412  0.5)
(-0.5  -0.3568627450980393  0.5)
(-0.5  -0.34901960784313724  0.5)
(-0.5  -0.3411764705882353  0.5)
(-0.5  -0.33333333333333337  0.5)
(-0.5  -0.3254901960784313  0.5)
(-0.5  -0.3176470588235294  0.5)
(-0.5  -0.30980392156862746  0.5)
(-0.5  -0.3019607843137255  0.5)
(-0.5  -0.2941176470588236  0.5)
(-0.5  -0.28627450980392155  0.5)
(-0.5  -0.2784313725490196  0.5)
(-0.5  -0.2705882352941177  0.5)
(-0.5  -0.26274509803921564  0.5)
(-0.5  -0.2549019607843137  0.5)
(-0.5  -0.24705882352941178  0.5)
(-0.5  -0.23921568627450984  0.5)
(-0.5  -0.2313725490196079  0.5)
...
(1.5  1.0  0.5)

);

type            sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;
setFormat	raw;



//executeControl  endTime;
//writeControl    endTime;
//writeInterval   4000;

executeControl  timeStep;
writeControl    timeStep;
writeInterval   100;
stopAt          endTime;

sets
(
    points
    {
        type    points;
        axis    xyz;
        points  $points;
        ordered  1;
    }
);